IDEA Open Model
MatReinforcementEc2.Fyk Property
Compatible with IDEA StatiCa v 10.1
 Characteristic yield strength of reinforcement - fyk
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.1.1 (10.1.1.1)
Syntax
public double Fyk { get; set; }
Public Property Fyk As Double
	Get
	Set
public:
property double Fyk {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
MatReinforcementEc2 Class
IdeaRS.OpenModel.Material Namespace